In [10]:
import pandas as pd

In [11]:
people_dict = {
    'id': ['1001', '1002', '1003'],
    'first_name': ['Alice', 'Bartholomew', 'Claire'],
    'last_name': ['Zane', 'Yeoman', 'Xavier'],
    'email_address': ['a_zane@email.com', 'b_yeoman@email.com', 'c_xavier@email.com']
    }

people_df = pd.DataFrame(people_dict)
people_df

     id   first_name last_name       email_address
0  1001        Alice      Zane    a_zane@email.com
1  1002  Bartholomew    Yeoman  b_yeoman@email.com
2  1003       Claire    Xavier  c_xavier@email.com

In [12]:
name_filter_0 = (people_df['last_name'] == 'Zane')

In [13]:
people_df[name_filter_0]

     id first_name last_name     email_address
0  1001      Alice      Zane  a_zane@email.com

In [14]:
people_df.loc[name_filter_0, ['email_address']]

      email_address
0  a_zane@email.com

In [15]:
name_filter_1 = (people_df['last_name'] == 'Xavier') & (people_df['first_name'] == 'Claire')
people_df.loc[name_filter_1, ['email_address']]

        email_address
2  c_xavier@email.com

In [16]:
name_filter_2 = (people_df['last_name'] == 'Xavier') & (people_df['first_name'] == 'Carl')
people_df.loc[name_filter_2, ['email_address']]

Empty DataFrame
Columns: [email_address]
Index: []

In [17]:
name_filter_3 = (people_df['first_name'] == 'Bartholomew') | (people_df['first_name'] == 'Alice') | (people_df['first_name'] == 'John')
people_df.loc[name_filter_3, ['first_name', 'email_address']]

    first_name       email_address
0        Alice    a_zane@email.com
1  Bartholomew  b_yeoman@email.com

In [18]:
name_filter_4 = (people_df['last_name'] == 'Yeoman')
people_df.loc[name_filter_4]

     id   first_name last_name       email_address
1  1002  Bartholomew    Yeoman  b_yeoman@email.com

In [19]:
name_filter_4 = (people_df['last_name'] == 'Yeoman')
people_df.loc[~name_filter_4]

     id first_name last_name       email_address
0  1001      Alice      Zane    a_zane@email.com
2  1003     Claire    Xavier  c_xavier@email.com

In [20]:
sr_df = pd.read_csv('../Data/partial_public_survey_results.csv', index_col='ResponseId')
srs_df = pd.read_csv('../Data/survey_results_schema.csv', index_col='qname')

pd.set_option('display.max_columns', 113)
pd.set_option('display.max_rows', 87)

In [37]:
high_salary_filter = (sr_df['CompTotal'] >= 70000) & (sr_df['Country'] == 'United States of America')

sr_df.loc[high_salary_filter, ['CompTotal', 'LanguageHaveWorkedWith']]

            CompTotal                             LanguageHaveWorkedWith
ResponseId
390          110000.0          HTML/CSS;JavaScript;Python;SQL;TypeScript
399          195000.0  Bash/Shell (all shells);C#;HTML/CSS;JavaScript...
429          230000.0             Bash/Shell (all shells);Go;Python;Rust
432           85000.0  Bash/Shell (all shells);C#;C++;Go;HTML/CSS;Jav...
433          160000.0           C#;Go;HTML/CSS;JavaScript;SQL;TypeScript
...               ...                                                ...
9841         130000.0  Bash/Shell (all shells);C;C#;C++;HTML/CSS;Java...
9842         120000.0                                  Elixir;JavaScript
9865         200000.0                    Bash/Shell (all shells);C#;Java
9888          80000.0  C#;HTML/CSS;Java;JavaScript;Python;R;SQL;TypeS...
9932         350000.0  Bash/Shell (all shells);Dart;Java;JavaScript;K...

[1130 rows x 2 columns]

In [43]:
country_filter_list = ['United States of America', 'United Kingdom of Great Britain and Northern Ireland', 'Ireland']
country_filter = sr_df['Country'].isin(country_filter_list)

sr_df.loc[country_filter, ['Country', 'LanguageAdmired']]

,Country,LanguageAdmired
ResponseId,,
1,United States of America,NaN
2,United Kingdom of Great Britain and Northern I...,Bash/Shell (all shells);Go;HTML/CSS;Java;JavaS...
3,United Kingdom of Great Britain and Northern I...,C#
6,United States of America,Bash/Shell (all shells);HTML/CSS;Java;JavaScri...
7,United States of America,R
...,...,...
9952,United States of America,C++;Java;Lua
9976,United Kingdom of Great Britain and Northern I...,VBA
9996,United States of America,Bash/Shell (all shells);C;C++;Python
9998,United Kingdom of Great Britain and Northern I...,Apex;HTML/CSS;JavaScript;SQL
9999,United Kingdom of Great Britain and Northern I...,C#;PowerShell;SQL

In [44]:
language_filter = sr_df['LanguageAdmired'].str.contains('Python', na=False)
sr_df.loc[language_filter, ['Country', 'LanguageAdmired']]

,Country,LanguageAdmired
ResponseId,,
2,United Kingdom of Great Britain and Northern I...,Bash/Shell (all shells);Go;HTML/CSS;Java;JavaS...
4,Canada,HTML/CSS;Java;JavaScript;PowerShell;Python;SQL...
5,Norway,C++;HTML/CSS;JavaScript;Lua;Python
6,United States of America,Bash/Shell (all shells);HTML/CSS;Java;JavaScri...
11,United States of America,JavaScript;Python;Ruby
...,...,...
9994,Turkey,Bash/Shell (all shells);C#;HTML/CSS;JavaScript...
9995,Taiwan,C#;Dart;Java;JavaScript;Kotlin;PHP;Python
9996,United States of America,Bash/Shell (all shells);C;C++;Python
9997,Germany,C#;HTML/CSS;Python;SQL
10000,Romania,C#;JavaScript;Python;TypeScript